wlbxcj/STM32P10/STMP10/src/driver/main.c

#include "stm32f10x_lib.h"
#include "flashoperate.h"
#include "usb_lib.h"
#include "hw_config.h"
#include "usb_core.h"
//#include "vosapi.h"
//#define SKX_FOR_LIB//生成库文件

#ifndef SKX_FOR_LIB

#include "KF701DH.h"
#include "KF701DV.h"
#include "Toolkit.h"

#include "var.h"
#include "kb.h"

#include "ASCII8X8.h"

//#define FLASH_4M
//#define FLASH_8M
#define FLASH_16M
//#define FLASH_32M

#ifdef FLASH_4M
  #define SECTOR 63
  #define RANGE  0X400000
#endif

#ifdef FLASH_8M
  #define SECTOR 127
  #define RANGE  0X800000
#endif

#ifdef FLASH_16M
  #define SECTOR 64
  #define RANGE  0X1000000
#endif

#ifdef FLASH_32M
  #define SECTOR 511
  #define RANGE  0X2000000
#endif

#if 0
unsigned char g_byCurAppNum = 0xff;
#endif

extern void flsh_wr_operate(void);
extern unsigned char DisplayType;
extern unsigned char LedSegCode[];
extern void LedSegTest(void);
extern void test_all(char cmd);
extern void RF_TypeAB_test(unsigned char which_api);

void FileTest();

extern int  g_iVosFirstRunFlag;  // 1:first run, 0:not first run

//#include "rc531/Mifre_TmDef.h"
#include "pn512/Mifre_TmDef.h"

#if 0
/************************************************************
 针对第一次运行VOS时，须初始化
 ************************************************************/
int s_InitVos(void)
{
    int iRet;
	unsigned char buf[8];
	unsigned long temp[2];
	unsigned long dwCount;

	memset(buf,0xff,sizeof(buf));
	ByteToDword(&buf[0],4,&temp[0]);
	ByteToDword(&buf[4],4,&temp[1]);
     //now set run first  12/10/23 
    //g_iVosFirstRunFlag = CheckVosIsFirstRun();
    g_iVosFirstRunFlag = 1;
    if (0 != g_iVosFirstRunFlag)
    {//first time run
		s_PciWritePinCount(0,temp[0]);
		s_PciWritePinCount(1,temp[1]);
        //(void)s_RecreateSysKeyFile();
		s_DelAllSecrecyData();
        //tmp set      12/10/23   
        //AM_InitAll();
    }

    iRet = s_PciMMKCheck();
    if (0!=iRet)
    {
        //(void)SectorErase(0);
        //(void)s_RecreateSysKeyFile();
		s_DelAllSecrecyData();
                
        //AM_InitAll();  //12/10/23 disable
                
        s_PciInitMMK();
        g_iVosFirstRunFlag = 1;
    }
    return 0;
}
#endif

unsigned char CheckFirst()
{
    unsigned char sBuf[2];
    sys_flash_read_operate(0, sBuf,2);
    if(memcmp(sBuf,"\xa5\xa5",2)==0)
      return 0;
    return 1;
  
}

void testreset()
{
    int iRet,i = 0;//,ret;
     //uchar kb;
     //int ExitPinPedProc =1;
     //uchar sBuf[100];
    APDU_SEND ApduSend;
	APDU_RESP ApduResp;
#if 0
     Lib_IccClose(1);
     iRet = Lib_IccOpen(1,1,sBuf);
	  trace_debug_printf("\nLib_IccOpen[%d]",iRet);
	  if(iRet==0)
	  {
                for(i=0;i<sBuf[0];i++)
                  trace_debug_printf("%02x ",sBuf[i+1]);
	  }
#endif
		memcpy(ApduSend.Command, "\x00\xa4\x04\x00", 4);
		memcpy(ApduSend.DataIn, "1PAY.SYS.DDF01", 14);
		ApduSend.Le=256;
		ApduSend.Lc=14;

		iRet = Lib_IccCommand(1, &ApduSend, &ApduResp);
		if (iRet)
		{
			Lib_LcdPrintxy(0, (i+1)*8, 0x00, "SLOT%d:CMD ERROR", i+1);
			Lib_Beef(3, 500);
			
		}
		else
		{
		    trace_debug_printf("\ncommand:");
		    for(i=0; i<ApduResp.LenOut; i++)
			    trace_debug_printf("%02x ",ApduResp.DataOut[i]);
		}
#if 0
     Lib_IccClose(2);
		         iRet = Lib_IccOpen(2,1,sBuf);
	  trace_debug_printf("\nLib_IccOpen[%d]",iRet);
	  if(iRet==0)
	  {
                for(i=0;i<sBuf[0];i++)
                  trace_debug_printf("%02x ",sBuf[i+1]);
	  }
#endif          
		iRet = Lib_IccCommand(2, &ApduSend, &ApduResp);
		if (iRet)
		{
			Lib_LcdPrintxy(0, (i+1)*8, 0x00, "SLOT%d:CMD ERROR", i+1);
			Lib_Beef(3, 500);
			
		}
		else
		{
		    trace_debug_printf("\ncommand:");
		    for(i=0;i<ApduResp.LenOut;i++)
			  trace_debug_printf("%02x ",ApduResp.DataOut[i]);
		}
                Lib_KbGetCh();
}

//__IO uint8_t PrevXferComplete = 1;


void main()
{
    initial_system();//115200
    /* 所有的测试程序都要放在maintest中 */
    maintest();

#if 0   
 //触发
   if(CheckFirst())
   {
      sys_flash_erase_page(0);
      memcpy(sBuf,"\xa5\xa5",2);
      flash_write_operate(0+SysStartAddr,(unsigned short*)sBuf,2);
      WriteToBackupReg(5,0xA5A5);
      
   }
   else
   {  
      if(CheckBackupReg(5,0xA5A5)) //触发
      {
	//Lib_LcdCls();
	Lib_LcdPrintxy(0, 2*8, 0x00, "TAMPER!!!");
        sys_flash_erase_page(0);//下次为第一次
        
        RM_flash_erase_page(0);
        RM_flash_erase_page(1);
        RM_flash_erase_page(2);
        RM_flash_erase_page(3);
        RM_flash_erase_page(4);
        RM_flash_erase_page(5);
        RM_flash_erase_page(6);
        memset(sBuf,0,sizeof(sBuf));
        flash_write_operate(0,(unsigned short*)sBuf,2048);
    
	//Lib_LcdCls();
	//Lib_LcdPrintxy(0, 2*8, 0x00, "TAMPER!!!");
	Lib_KbGetCh();
        for(;;);
      }
   }
#endif
   
#if 0
   //TestKbGetch();
   s_KbInit();
   for(;;)
   {
#if 0     
     if(Keyboard_Change_Flag==1)
     {
        trace_debug_printf("[%d]",Keyboard_Val);
        Keyboard_Change_Flag = 0 ;   //清除键盘改变标志位

     }
#endif
     
   }
#if 0
   for(;;)
   {
     
     i = Get_KeyValue();
     if(i!=0)
     {
       
     trace_debug_printf("[%c]",i);
     }
   }
#endif   
  //test
  gettime(&tTime);
  tTime.tm_sec = 50;
  settime(&tTime);
  gettime(&tTime);

  
  ledall_on();
 
  
  Buzzer_Ring(3200);  
  delay_ms(50); 
  Buzzer_Off();     
  ledall_off(); 
  
  //NVIC_GenerateCoreReset();//software reset core
  //Show  Test
#if 0 
  if(DisplayType)  
    LedSegTest();            //LED
  else      
#endif
    
    LcdDotTest();            //LCD
  

    
 // Entry_CoreInit();  //gplian
 // QPboc_CoreInit();  //gplian

  //LcdDotTest();
  
  //led test
  /*
  ledall_off();
  while(1)
  {
    ledgreen_on();
    delay_ms(50);
    ledgreen_off();
    delay_ms(100);
    ledred_on();
    delay_ms(50);
    ledred_off();
    delay_ms(100);
    ledorange_on();
    delay_ms(50);
    ledorange_off();
    delay_ms(100); 
  }
  */
  //uart test
  //uart_test(i);
  
  //uart driver test
  //uart_driver_test(i);
  
  //delay test
  
  /*
  while(1)
  {
    
    WaitNuS(50); 
    //GPIOC, GPIO_Pin_13
    GPIOC->BSRR = GPIO_Pin_13;
    WaitNuS(50); 
    GPIOC->BRR = GPIO_Pin_13;
  }
  */
  
  //sys timer test
  //systimer_test(1);

  //test protocol
  //Uart_Protocol();//协议处理
  
  //test flash
  //flash_op_test();
  
  //Rf Test
  
  extern void RfTestAll(void);

  RF_TypeAB_test(0);
  //MifreQpbocTest();
  //lian disable
  //RfTestAll();

//test
 // FileTest();
 
