wlbxcj/STM32P10/STMP10/src/driver/main.c
  //for factory test
  //test_all(i);
  
  //lian
  //debug_printf(0,0,0,"%i\n",-6);
  
  //ContactlessCardProc("\x00\x00\0x10\x00\x00",value);

//  Uart_Protocol();//协议处理
  
  delay_ms(5000);   
  Lcdarray_clear(0x0F);
  LcdBL_Control(0);
#endif
  while(1);
}

#if 0
void FileTest()
{
#pragma pack(1)

typedef struct 
{
	uchar bAidLen;
	uchar sAid[16];
	uchar bSelectIndicator; //选择标志(0xff:partial_MATCH 部分匹配,full_Match)
	uchar bKernType;      //应用内核类型
						  //	KERNTYPE_DEF：根据RID，内核进行匹配确认;
	  						  //KERNTYPE_JCB：JCB
	 						  //KERNTYPE_MC:MASTERCARD
	 						  //KERNTYPE_VIS：VISA
	 						  //KERNTYPE_PBOC：PBOC
	 						  //其它：返回参数错误

	
	uchar sRFU[1];        //凑为20byte
}T_ENTRY_APP_LISTT; //guohonglv

typedef struct 
{
	unsigned long ulTermFLmt;     //Terminal Floor Limit (Tag ‘9F1B
	unsigned long ulRdClssTxnLmt; //Terminal Contactless Transaction Limit
	unsigned long ulRdCVMLmt;     //Terminal CVM Required Limit
	unsigned long ulRdClssFLmt;   //Terminal Contactless Floor Limit

	unsigned char aucAID[16];       
	unsigned char ucAidLen; 
	
	unsigned char ucKernType; // 定义后续该AID 所遵循的内核类型

	// payWave
	unsigned char  ucCrypto17Flg;
	unsigned char   ucZeroAmtNoAllowed;       // 0-若授权金额=0,则TTQ要求联机密文, 1-若授权金额=0, 则内部qVSDC不支持标志置位
	unsigned char   ucStatusCheckFlg;    // 读卡器是否支持状态检查
    unsigned char   aucReaderTermTransQualifiers[4];      // 终端交易性能，用于VISA/PBOC中，tag =9F66
	
	// common
	unsigned char ucTermFLmtFlg; 
	unsigned char ucRdClssTxnLmtFlg; 
	unsigned char ucRdCVMLmtFlg;   
	unsigned char ucRdClssFLmtFlg; 	 
	
	unsigned char aucRFU[3];
}Clss_PreProcInfoo; //guohonglv
#pragma pack()

	int fid,i;
	unsigned char sBuf[300],sPageBuf[2048];
	TERMAPPLIST tTermAppList;
	T_ENTRY_APP_LISTT tEntryAppList;
	Clss_PreProcInfoo tPreProcInfo;
/*	
	fid=open(FILE_TERMAPP_M, O_RDWR | O_CREAT | O_SYNC);
	for(i=0;i<50;i++)
	{
		memset(&tTermAppList,i,sizeof(TERMAPPLIST));
		write(fid,&tTermAppList,sizeof(TERMAPPLIST));
	}
	lseek(fid,0,SEEK_SET);
	for(i=0;i<50;i++)
	{
		read(fid,&tTermAppList,sizeof(TERMAPPLIST));
		memset(sBuf,i,sizeof(TERMAPPLIST));
		if(memcmp(sBuf,&tTermAppList,sizeof(TERMAPPLIST)))
			break;
	}
	//flash_read_operate(0x0807D800,sPageBuf,2048);
*/
	
	flash_read_operate(0x0807D800,sBuf,300);
        return ;
	flash_read_operate(0x0807D800+2048,sBuf,300);

	flash_read_operate(0x0807D800+2048+0x25c,sBuf,300);
        
        fid=open(".\\data\\emv\\entryapplist", O_RDWR | O_CREAT | O_SYNC);
	for(i=0;i<30;i++)
	{
		memset(&tEntryAppList,i,sizeof(T_ENTRY_APP_LISTT));
		write(fid,&tEntryAppList,sizeof(T_ENTRY_APP_LISTT));
        	flash_read_operate(0x0807D800+2048+i*20,sBuf,24);
                
	}
	lseek(fid,0,SEEK_SET);
	for(i=0;i<30;i++)
	{
		read(fid,&tEntryAppList,sizeof(T_ENTRY_APP_LISTT));
		memset(sBuf,i,sizeof(T_ENTRY_APP_LISTT));
		if(memcmp(sBuf,&tEntryAppList,sizeof(T_ENTRY_APP_LISTT)))
			break;
	}
	
	fid=open(".\\data\\emv\\preprocinfo", O_RDWR | O_CREAT | O_SYNC);
	for(i=0;i<30;i++)
	{
		memset(&tPreProcInfo,i,sizeof(Clss_PreProcInfoo));
		write(fid,&tPreProcInfo,sizeof(Clss_PreProcInfoo));
	}
	lseek(fid,0,SEEK_SET);
	for(i=0;i<30;i++)
	{
		read(fid,&tPreProcInfo,sizeof(Clss_PreProcInfoo));
		memset(sBuf,i,sizeof(Clss_PreProcInfoo));
		if(memcmp(sBuf,&tPreProcInfo,sizeof(Clss_PreProcInfoo)))
			break;
	}

	return;
	
}

void LedSegTest(void)
{
  uchar i,j;
  uchar LedSegVal[8];
  uchar LedSegNum[8] = {0x01,	0x2,	0x3,	0x4,	0x5,	0x6,	0x7,	0x8};

  for(i=0;i<8;i++) LedSegVal[i] = LedSegCode[LedSegNum[i]];
  Ledarray_On(LedSegVal);
  //while(1);
  delay_ms(100);    
  for(j=1;j<8;j++)  
  {
    LedSegNum[j-1] = 0x12;
    LedSegNum[j] = j+1;
    LedSegVal[j-1] = LedSegCode[LedSegNum[j-1]];
    LedSegVal[j] = LedSegCode[LedSegNum[j]];
    Ledarray_On(LedSegVal);    
    delay_ms(100);    
  }    
   
  LedSegVal[7] = LedSegCode[0x12];
  Ledarray_Off();
}


void Display16Regs(uchar PageX,uchar *pRegValue)
{
  uchar i,Reg4Bit;
  uchar LcdLine[16];
  
  LcdLine[0] ='P';
  LcdLine[1] ='g';  
  LcdLine[2] = PageX + '0';
  LcdLine[3] = ':';
  LcdLine[4] = 0x00; 
  Lcdstring_On(0,0,LcdLine);  
  //Line0
  for(i=0;i<4;i++)
  {
    Reg4Bit = *(pRegValue+i) >> 4;
    if(Reg4Bit < 0x0A)  LcdLine[i*3] = Reg4Bit + '0';
    else                LcdLine[i*3] = Reg4Bit + '7';
    Reg4Bit = *(pRegValue+i) & 0x0F;
    if(Reg4Bit < 0x0A)  LcdLine[i*3+1] = Reg4Bit + '0';    
    else                LcdLine[i*3+1] = Reg4Bit + '7';  
    LcdLine[i*3+2] = ' ';
  }
  LcdLine[12] = 0x00; 
  Lcdstring_On(0,32,LcdLine);   
  
  //Line1
  pRegValue += 4;
  for(i=0;i<4;i++)
  {
    Reg4Bit = *(pRegValue+i) >> 4;
    if(Reg4Bit < 0x0A)  LcdLine[i*3] = Reg4Bit + '0';
    else                LcdLine[i*3] = Reg4Bit + '7';
    Reg4Bit = *(pRegValue+i) & 0x0F;
    if(Reg4Bit < 0x0A)  LcdLine[i*3+1] = Reg4Bit + '0';    
    else                LcdLine[i*3+1] = Reg4Bit + '7';  
    LcdLine[i*3+2] = ' ';
  }
  LcdLine[12] = 0x00; 
  Lcdstring_On(1,32,LcdLine);     
  
  //Line2
  pRegValue += 4;
  for(i=0;i<4;i++)
  {
    Reg4Bit = *(pRegValue+i) >> 4;
    if(Reg4Bit < 0x0A)  LcdLine[i*3] = Reg4Bit + '0';
    else                LcdLine[i*3] = Reg4Bit + '7';
    Reg4Bit = *(pRegValue+i) & 0x0F;
    if(Reg4Bit < 0x0A)  LcdLine[i*3+1] = Reg4Bit + '0';    
    else                LcdLine[i*3+1] = Reg4Bit + '7';  
    LcdLine[i*3+2] = ' ';
  }
  LcdLine[12] = 0x00; 
  Lcdstring_On(2,32,LcdLine);   

  //Line3
  pRegValue += 4;
  for(i=0;i<4;i++)
  {
    Reg4Bit = *(pRegValue+i) >> 4;
    if(Reg4Bit < 0x0A)  LcdLine[i*3] = Reg4Bit + '0';
    else                LcdLine[i*3] = Reg4Bit + '7';
    Reg4Bit = *(pRegValue+i) & 0x0F;
    if(Reg4Bit < 0x0A)  LcdLine[i*3+1] = Reg4Bit + '0';    
    else                LcdLine[i*3+1] = Reg4Bit + '7';  
    LcdLine[i*3+2] = ' ';
  }
  LcdLine[12] = 0x00; 
  Lcdstring_On(3,32,LcdLine);   
}


//add aging test pro

void test_all(char cmd)
{
  int i,j,k;
  while(1)
  {
    //if(DisplayType)  LedSegTest();            //LED
    //else             
      LcdDotTest();            //LCD
  
    RF_TypeAB_test(i);
  }
  
   
