wlbxcj/STM32P10/STMP10/src/driver/main.c
}



int ContactlessCardProc(uchar *psAmountBcd,uchar *psRet)   

//uchar ContactlessCardProc()   

{

	uchar ret,buf[100],mode=0,tmp[100],swa[10],swb[10],time1[10],time2[10],Aid[32],key;
	int result,time,len,i,k,Aidlen;
	unsigned short tag;
	uchar amt[13];
        POS_COM gtPosCom; //guohonglv
        //struct ClssProcInter ClssProcInterInfo;//guohonglv
        //struct ClssEc ClssEcParam; //guohonglv
        //struct gtPosParamet gtPosParameter; //guohonglv
        
        T_Clss_TransParam tClssEcParam;
        T_Clss_PreProcInterInfo tClssProcInterInfo;
        PICC_PARA PiccPara;
        
	uchar inActype[256],outActype[256];
	uchar keyId;
	struct tm sTime;

	*psRet = 0;
	if( (ret=ClssTransInit()) != EMV_OK) 
	{
		TraceDisp("ClssTransInit[%i]\n",ret);
		*psRet = RC_FILE_ERR;
		return NO_DISP;
	}

	
 	gtPosCom.ucSwipedFlag = CONTACTLESS_ENTER; //guohonglv

//	ret = AppGetAmount(6, TRAN_AMOUNT,(char*)buf);
//	if(ret != OK) return ret;
	memcpy(gtPosCom.tEmvTrans.sAmount,psAmountBcd,6);

	memset(buf,0,sizeof(buf));
	dat_bcdtoasc( buf, gtPosCom.tEmvTrans.sAmount, 12 );

	tClssEcParam.ulAmntAuth = atol(buf);
	tClssEcParam.ulAmntOther = 0;
	//ClssEcParam.ucTransType = EMV_GOODS;
	tClssEcParam.ucTransType = 0;


	
	gettime(&sTime);
	
	tClssEcParam.aucTransDate[0] = ((sTime.tm_year/10)<<4)|(sTime.tm_year%10);
	tClssEcParam.aucTransDate[1] = ((sTime.tm_mon/10)<<4)|(sTime.tm_mon%10);
	tClssEcParam.aucTransDate[2] = ((sTime.tm_mday/10)<<4)|(sTime.tm_mday%10);

	tClssEcParam.aucTransTime[0] = ((sTime.tm_hour/10)<<4)|(sTime.tm_hour%10);
	tClssEcParam.aucTransTime[1] = ((sTime.tm_min/10)<<4)|(sTime.tm_min%10);
	tClssEcParam.aucTransTime[2] = ((sTime.tm_sec/10)<<4)|(sTime.tm_sec%10);
	
	tClssEcParam.ulTransNo = gtPosParameter.lNowTraceNo;


	
	result = Entry_PreTransProc((T_Clss_TransParam *)&tClssEcParam);  //guohonglv 不知道为什么，必须进行类型的强制转换

	TraceDisp("Entry_PreTransProc[%i]\n", result);
	
	if(result == CLSS_USE_CONTACT) 
	{

		*psRet = RC_USE_CONTACT;
		return (disp_clss_err(result));
		
	}

	if(result != EMV_OK)
	{
		*psRet = RC_FAILURE;
		return E_TRANS_FAIL;
	}

	ClrBelow(2);
	memset(buf,0,sizeof(buf));

	sprintf(tmp, "%012ld", tClssEcParam.ulAmntAuth);
	tableamount(tmp,12 );
	sprintf(buf,"金额: %s",tmp);
	lcdshow(1, MIDDLE, 1, buf);
	
	
	while(1){
	//if( (bRet=Picc_open()))
	//	printf("Picc open err [%02x]\n",bRet);
		
		//if(Picc_open() != 0){
		if(picc_open() != 0){
			lcdshow(2,MIDDLE,1,"射频模块故障");
			//Picc_close();
			picc_close();
			WaitKey(3);
			TraceDisp("picc_open err");
			*psRet = RC_READER_ERR;
			return NO_DISP;
		}
                
		PiccPara.wait_retry_limit_w = 1;
		PiccPara.wait_retry_limit_val = 0;
		PiccPara.card_buffer_w = 1;
		PiccPara.card_buffer_val = 256; 
		//Picc_setup('W',&PiccPara);
		picc_setup('W',&PiccPara);

	
		lcdshow(2,MIDDLE,1,"请出示射频卡");
		
		TimerSet(3,WAITTIMEFORDETECT);  //   10ms unit
		while(1)
		{
			//if(getkey() == KEY_ESC) 
			//	return E_TRANS_CANCEL;
			
			if( !TimerCheck(3) ) 
			{
				//*psRet = RC_TRAN_FAILURE;
				*psRet = RC_NO_CARD;
				return E_TRANS_FAIL;
			}
			//ret = Picc_detect(mode,NULL,NULL,NULL,NULL);
			ret = picc_detect(mode,NULL,NULL,NULL,NULL);
                        
			if(ret == 0) break;
			if(ret == 1 ||ret==2)
			{
				*psRet = RC_READER_ERR;
				return E_TRANS_FAIL;
			}
			if(ret == 3||ret==5||ret==6){
				delay_ms(100);
				continue;
			}
			if(ret == 4){
				lcdshow(2,MIDDLE,1,"感应区卡片过多");
				//Picc_close();
				picc_close();
				delay_ms(1000);
				break;
			}
		}
		if(ret == 4)
		{
			//continue;  //2011/03/10 disable,terminal should display
			*psRet = RC_MORE_CARDS;
			return E_TRANS_FAIL;
		}
		break;
	}

        
	ClrBelow(2);
	
	
	lcdshow(1, MIDDLE, 1, "请稍侯...");
//	memcpy(PosCom.stTrans.szEntryMode, "072", 3);
	buf[0] = 0x07;
	Contactless_SetTLVData(0x9f39,buf,1);
//	gtPosCom.ucSwipedFlag = CONTACTLESS_ENTER;
	Contactless_SetTLVData(0x9c,"\x00",1);
	
	
		
	result = Entry_AppSlt(0,0);

TraceDisp("Entry_AppSlt[%i]\n",result);
    
	if(   result == EMV_NO_APP ||result == ICC_BLOCK || result == EMV_APP_BLOCK) 
	{
		TraceDisp("Entry_AppSlt[%i]\n",result);
		if(result == EMV_NO_APP)
			*psRet = RC_EMV_NO_APP;
		else if(result == ICC_BLOCK)
			*psRet = RC_ICC_BLOCK;
		else
			*psRet = RC_EMV_APP_BLOCK;
			
		return(disp_clss_err(result));
	}
	if(result != EMV_OK)
	{
		if(result==ICC_CMD_ERR)
		{
			*psRet =RC_ICC_CMD_ERR;
			TraceDisp("交易终止_0");
			return E_TRANS_FAIL;
				
		}
		//*psRet = RC_TRAN_FAILURE;
		*psRet =RC_TERMINATE; // 11/06/04 交易终止
		TraceDisp("交易终止_1");
		return E_TRANS_FAIL;
	}

	while(1){
		memset(buf,0,sizeof(buf));

		result = Entry_FinalSelect(buf, Aid, &Aidlen);

	TraceDisp("Entry_FinalSelect[%i]\n",result);
	
		if(result == EMV_NO_APP || result == CLSS_USE_CONTACT ) 
		{
			if(result==EMV_NO_APP)
				*psRet = RC_EMV_NO_APP;
			else
				*psRet = RC_USE_CONTACT;
			return(disp_clss_err(result));
		}
		if(result != EMV_OK)
		{
			#ifdef PAYWAVE_M    //shall select the next application with highest priority when the SW1
								//SW2 response t the SELECT ADF command is not ‘9000’
			Entry_DelCurCandApp();
			continue;				
			#else
			if(result==CLSS_RESELECT_APP)
			{
				Entry_DelCurCandApp();
				continue;				
				
			}
			
			//*psRet = RC_TRAN_FAILURE;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return E_TRANS_FAIL;
			#endif
		}

//TraceDisp("kernel type[%i]\n",buf[0]);

		if( buf[0] != KERNTYPE_PBOC )
		{
			//*psRet = RC_TRAN_FAILURE;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return E_TRANS_FAIL;
		}
		/*pos_com.log.vis_qpboc_flag*/
                keyId = buf[0];

		QPboc_SetTLVData(0x9C,"\x00",1);
		result = Entry_GetPreProcInterFlg((T_Clss_PreProcInterInfo *)&tClssProcInterInfo);   // guohonglv 对参数进行了类型转换

	TraceDisp("Entry_GetPreProcInterFlg[%i]\n",result);
	
		if( result == CLSS_USE_CONTACT )
		{
			//*psRet = RC_USE_CONTACT;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return disp_clss_err(result);
		}
		else if( result == CLSS_TERMINATE)
		{
			*psRet = RC_TERMINATE;
			return disp_clss_err(result);

