wlbxcj/STM32P10/STMP10/src/driver/main.c
		}
			
		if( result != EMV_OK ) 
		{
			//*psRet = RC_TRAN_FAILURE;
			*psRet = RC_TERMINATE; //11/06/12
			return E_TRANS_FAIL;
		}
		
		result = Entry_GetFinalSelectData(inActype, &len);

	TraceDisp("Entry_GetFinalSelectData[%i]\n",result);
		if( result != EMV_OK )
		{
			//*psRet = RC_TRAN_FAILURE;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return E_TRANS_FAIL;
		}

		result = QPboc_SetFinalSelectData(inActype,len);
	TraceDisp("QPboc_SetFinalSelectData[%i]\n",result);
		
		if( result != EMV_OK )
		{
			//*psRet = RC_TRAN_FAILURE;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return E_TRANS_FAIL;
		}

		result = QPboc_SetTransData(&tClssEcParam, &tClssProcInterInfo);
	TraceDisp("QPboc_SetTransData[%i]\n",result);

		if( result != EMV_OK)
		{
			//*psRet = RC_TRAN_FAILURE;
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return E_TRANS_FAIL;
		}

		memset(tmp,0,sizeof(tmp));
		memset(outActype,0,sizeof(outActype));
		result = QPboc_Proctrans(tmp, outActype);

		
	TraceDisp("QPboc_Proctrans[%i]\n",result);
		if(result == CLSS_RESELECT_APP){ //
			Entry_DelCurCandApp();
			continue;
			//*psRet =RC_TERMINATE; // 11/06/08 交易终止
			//return E_TRANS_FAIL;
			
		}
		if(result == CLSS_USE_CONTACT ) //converto to the other card-> the other card(ex contact IC) not support -->terminate 11/06/08 
		{
			//*psRet = RC_USE_CONTACT; 
			*psRet =RC_TERMINATE; // 11/06/04 交易终止
			return(disp_clss_err(result));
		}
		if( (result == EMV_USER_CANCEL) || (result==EMV_DATA_ERR) 
			||(result == EMV_RSP_ERR) )   //2011/02/18
		{

			*psRet = RC_TERMINATE; 
			return(disp_clss_err(result));

		}

		
		if(result != EMV_OK) 
		{
			//CLSS_CARD_EXPIRED
			//PAYWAVE: ensure that if the card returns a TC, the reader shall continue the
			//transaction online if the Application Expiration Date is earlier than the
			//current terminal date and if the CTQ indicates “G Online If Application
			//Expired” is 1.
			if(result==CLSS_CARD_EXPIRED)
				//*psRet = RC_DECLINE;	
				*psRet = RC_CARD_EXPIRED;	//11/06/08
			else
				*psRet = RC_TRAN_FAILURE; 
			return E_TRANS_FAIL;
		}

		break;
	}

	if(tmp[0] == CLSS_VISA_MSD)
	{
		buf[0] = 0x91; //ENTRY MODE
		Contactless_SetTLVData(0x9f39,buf,1);

	}
	tag = 0x57;
	ret = Contactless_GetTLVData(tag,tmp,&len);
	if(ret != EMV_OK)
	{
		//*psRet = RC_TRAN_FAILURE; 
		*psRet =RC_TERMINATE; // 11/06/04 交易终止
		TraceDisp("交易终止_14\n");
		return E_TRANS_FAIL;
	}
	dat_bcdtoasc(gtPosCom.szTrack2,tmp,len*2);

	len = len*2;
	gtPosCom.szTrack2[len]=0;
	if((tmp[len/2-1] & 0x0f) == 0x0f){
		gtPosCom.szTrack2[len-1] = 0;
	}
	gtPosCom.szTrack2[37]=0;
	for(i=0;i<len;i++){
		if(gtPosCom.szTrack2[i] == 'D'){
			gtPosCom.szTrack2[i] = '=';
			break;
		}
	}
	ret = GetCardFromTrack(gtPosCom.szCardNo,gtPosCom.szTrack2,NULL);
	if(ret != EMV_OK)
	{
		//*psRet = RC_TRAN_FAILURE; 
		*psRet =RC_TERMINATE; // 11/06/04 交易终止
		TraceDisp("交易终止_15\n");
		return E_TRANS_FAIL;
	}


	gtPosCom.tEmvTrans.PANSN = 0xff;
	//PosCom.stTrans.bPanSeqNoOk = FALSE;
	ret = Contactless_GetTLVData(0x5f34,tmp,&len);
		
	if(ret == EMV_OK) 
	{
		//PosCom.stTrans.bPanSeqNoOk = TRUE;
		gtPosCom.tEmvTrans.PANSN = tmp[0];
	}
	
	if(outActype[0] == AC_AAC || 
		outActype[0]==0x11 )   //cryptogram type cannot be determined,the reader shall set the Decline
	{
		//return TRANS_REF;
		*psRet = RC_DECLINE;
		TraceDisp("交易拒绝_16\n");
		return 29;
	}
	if(outActype[0] == AC_ARQC){

		*psRet = RC_ONLINE;

	
		//使用宏
		//if(memcmp(Aid,"\xA0\x00\x00\x03\x33\x01\x01\x06",8) == 0){
			result = QPboc_GetTLVData(0x9f5d,tmp,&len);
			if(result == EMV_OK){
				/*disable tmp disable
				PubBcd2Asc(tmp,12,amt);
				if(memcmp(tmp,PosCom.stTrans.sAmount,6) < 0){
					ScrClrLine(2,7);
					PubDispString("卡余额不足",LINE4|DISP_LINE_CENTER);
					
					WaitKey(1);
					return NO_DISP;
				}
				*/
				/* disable 11/06/01		
				if( tClssProcInterInfo.ucRdCLFLmtExceed == 1) {

					ClrBelow(2);
					lcdshow(2, MIDDLE, 1, "纯电子钱包卡");
					lcdshow(3, MIDDLE, 1, "超过脱机交易限额");
					WaitKey(1);
					*psRet = RC_EXCEED_OFFLINEAMT;
					return NO_DISP;
				}
				*/
			}
		//}
		
		QPboc_nGetTrack2MapData(tmp, &len);//track2等价数据 发送到terminal 2011/02/21

		QPboc_GetCvmType(tmp);


		return 0;
		//return(Clss_transmit(1)); disable tmp 10/10/18
	}
	
//11/06/08
//	QPboc_DelAllRevocList(); 
//	QPboc_DelAllCAPK();

	
	QPboc_GetTLVData(0x82,buf,&len);
	if( (buf[0] & 0x20)==0x20 ) //support dda 11/06/08
	{
		len = 0;
	
		result = QPboc_GetTLVData(0x8f,buf,&len);
		if(result == EMV_OK)
		{
			if(AppSetClss_capk(buf[0],Aid))
			{

			*psRet = RC_DECLINE;
			TraceDisp("交易拒绝_18\n");
			return EMV_NOT_FOUND;

			}
		//		AppSetClss_RevocList(buf[0],tmp);
		}
	}	

	result = QPboc_CardAuth(buf, tmp);
	//result = Clss_GetTLVData(0x9f6c,tmp,&len);

	TraceDisp("QPboc_CardAuth[%i] buf[%02x]\n",result,buf[0]);

	if(result == CLSS_USE_CONTACT)
	{
		//*psRet = RC_USE_CONTACT;
		*psRet =RC_TERMINATE; // 11/06/04 交易终止
		return(disp_clss_err(result));
	}

	if(result != EMV_OK)
	{
		//*psRet = RC_TRAN_FAILURE;
		*psRet =RC_TERMINATE; // 11/06/04 交易终止
		return E_TRANS_FAIL;
	}
	if(buf[0] == AC_ARQC) 
	{
		QPboc_GetCvmType(tmp);

		*psRet = RC_ONLINE;
		return 0;
		//return(Clss_transmit(1)); disable tmp 10/10/18
	}
	else if(buf[0] == AC_TC)
	{

		//11/05/31
		QPboc_GetCvmType(tmp);
		if((int)tmp[0]==RD_CVM_ONLINE_PIN)
		{
			*psRet = RC_ONLINE;
			//sdk_ScrDispRow("交易失败_21在线", 0, 1);
        	 TraceDisp("该交易需联机");
		 	return 0;

		}

		 //11/06/02 
		/* move to app 
		result = QPboc_GetTLVData(0x5A,tmp,&len);
		if(result == EMV_OK)
		{
			
			result = QPboc_GetTLVData(0x5F34,buf,&i);
			if(QPboc_SearchExceptionList(len,tmp,buf)==0)
			{
				*psRet = RC_DECLINE;
				sdk_ScrDispRow("交易拒绝-24", 0, 1);
				DisInquire();
				//return 29;
				return RC_DECLINE;

			}
		}
		*/
		
		return EMV_OK;
	}
	else  //the other is AAC
	{

		*psRet = RC_DECLINE;
		//return 29;
		return RC_DECLINE;

	}

	/* disable tmp 10/10/18
	Beep();

	result = QPboc_GetTLVData(0x9f5d,tmp,&len);
	if(result == EMV_OK){

		PubBcd2Asc(tmp,6,PosCom.stTrans.Ec_Balance);
		PosCom.stTrans.Ec_Balance[12]=0;
		memset(buf,0,sizeof(buf));
		ConvBcdAmount(tmp,buf);
		ScrClrLine(2,7);
		PubDispString("卡余额:",LINE5|DISP_LINE_CENTER);
		PubDispString(buf,LINE7|DISP_LINE_CENTER);
		//需要修改
		PubWaitKey(5);
	
	}

	Clss_SetTLVData(0x9f27,"\x40",1);
	Clss_SetTLVData(0x8a,"Y1",2);
	// PrepareDe55(EMV_OFF_SEND);
	InceaseTraceNo();
	
	*/
	return EMV_OK;

}
#endif

#endif
